OdDAI.ErrorEvent.makeErrorEvent(System.UInt32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Creates an error event with specified error code, description and function name.
\param errorId      [in] An error code.
\param description  [in] An error event description in a human-readable form.
\param functionName [in] A pointer to a null-terminated string that contains the name of the function that handles the event.
\returns A smart pointer to the created event.

OdDAI.ErrorEvent.description
\details
Retrieves the description of an error event.
\returns A pointer to a null-terminated string that contains the description text of the error event.

OdDAI.ErrorEvent.error
\details
Retrieves the error code of the event.
\returns The error code represented with a daiErrorId value.

OdDAI.ErrorEvent.testAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset.
\param attrName [in] An ANSI string that contains the attribute name.
\returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.ErrorEvent.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns An OdRxValue object that contains the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.ErrorEvent.op_Assign(OdDAI.ErrorEvent!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the ErrorEvent class.
\param other [in] An error event to assign.
\returns The ErrorEvent object modified by the assignment operation.
\remarks
Inaccessible.

OdDAI.ErrorEvent.#ctor(OdDAI.ErrorEvent!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copy constructor for the ErrorEvent class.
\param other [in] An error event to copy.
\remarks
Inaccessible.

OdDAI.ErrorEvent.Dispose
\details
Destroys the ErrorEvent object.

OdDAI.ErrorEvent.#ctor
\details
Creates an ErrorEvent object with default parameters.
By default, an error comes from the underlying system.

OdDAI.ErrorEvent
\details
The class represents error events that can be manipulated with the Data Access Interface (DAI).
\sa
Standard Data Access Interface Error Handling